In [1]:
import pandas as pd
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ["AAPL", "IBM", "MSFT", "GOOG"]}
price = pd.DataFrame({ticker: data['Adj Close']
            for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
            for ticker, data in all_data.items()})

In [2]:
volume.head()

                   AAPL        IBM        MSFT     GOOG
Date
2016-06-01  116693200.0  2663400.0  25324800.0  1253600
2016-06-02  160766400.0  2642600.0  22840800.0  1341800
2016-06-03  114019600.0  2328300.0  23368300.0  1226300
2016-06-06   93170000.0  2378700.0  18243300.0  1565300
2016-06-07   89638000.0  4465000.0  20866800.0  1336200

In [3]:
returns = price.pct_change()
returns.head()

                AAPL       IBM      MSFT      GOOG
Date
2016-06-01       NaN       NaN       NaN       NaN
2016-06-02 -0.007516  0.006491 -0.007001 -0.005108
2016-06-03  0.002046 -0.003974 -0.013148 -0.011035
2016-06-06  0.007251 -0.001047  0.006565 -0.008016
2016-06-07  0.004056  0.003929 -0.000576  0.000140

In [4]:
price.shape

(1258, 4)

In [6]:
returns['MSFT'].corr(returns['IBM'])

0.5300883782025547

In [7]:
returns['MSFT'].cov(returns['IBM'])

0.00015021229929045767

In [8]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.446158  0.726443  0.660388
IBM   0.446158  1.000000  0.530088  0.492515
MSFT  0.726443  0.530088  1.000000  0.771513
GOOG  0.660388  0.492515  0.771513  1.000000

In [9]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000363  0.000139  0.000239  0.000212
IBM   0.000139  0.000268  0.000150  0.000136
MSFT  0.000239  0.000150  0.000299  0.000225
GOOG  0.000212  0.000136  0.000225  0.000284

In [10]:
returns.corrwith(returns.IBM)

AAPL    0.446158
IBM     1.000000
MSFT    0.530088
GOOG    0.492515
dtype: float64

In [11]:
returns.corrwith(volume) # 볼륨량=거래량이 클수록 가격변동의 폭이 크지 않다고 해석 가능

AAPL   -0.054217
IBM    -0.100018
MSFT   -0.063450
GOOG   -0.117038
dtype: float64

In [12]:
volume.head()

                   AAPL        IBM        MSFT     GOOG
Date
2016-06-01  116693200.0  2663400.0  25324800.0  1253600
2016-06-02  160766400.0  2642600.0  22840800.0  1341800
2016-06-03  114019600.0  2328300.0  23368300.0  1226300
2016-06-06   93170000.0  2378700.0  18243300.0  1565300
2016-06-07   89638000.0  4465000.0  20866800.0  1336200

In [13]:
s1 = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [18]:
unique_items = s1.unique()

In [20]:
print(unique_items) # 중복값 제거 후 도수분포표

['c' 'a' 'd' 'b']

In [21]:
s1.value_counts() #counts를 이용한 개수산출

a    3
c    3
b    2
d    1
dtype: int64

In [26]:
df1 = pd.read_csv('examples/ex1.csv') # /로 구분되어있는 파일의 경우 **.csv, sep='/' 붙이면 가능
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
res = pd.read_table('examples/ex3.txt',sep="\s+") # \s+를 이용해서 다수의 빈칸을 기준으로 칸 나눔 가능
res

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [30]:
df2 = pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
df3 = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
df3

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
df4 = pd.read_csv('examples/ex5.csv')
df4.to_csv('examples/my_out_of_ex5.csv',
           na_rep="ToBeReplaced", index=False,
          columns=["a","b","c"]) #na_rep, index/header=False, columns=[]를 통해 데이터 값 변환하기